; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v7 - type_2 ?v3 - type_1)
 	      (pred_2 ?v4 - object ?v3 - type_1)
	      (pred_4 ?v7 - type_2 ?v8 - type_3)
	      (pred_1 ?v7 - type_2 ?v4 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v7 - type_2 ?v1 ?v2 - type_1)
       :precondition (and  (pred_3 ?v7 ?v1))
       :effect (and  (pred_3 ?v7 ?v2)
		     (not (pred_3 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_2 ?v5 - object ?v6 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v6) (pred_3 ?v7 ?v6) (pred_4 ?v7 ?v8))
       :effect (and (pred_1 ?v7 ?v5 ?v8)
		    (not (pred_2 ?v5 ?v6)) 
		    (not (pred_4 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_2 ?v5 - object ?v6 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v5 ?v8) (pred_3 ?v7 ?v6))
       :effect (and (pred_2 ?v5 ?v6)
		    (pred_4 ?v7 ?v8)
		    (not (pred_1 ?v7 ?v5 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_2
obj_02 obj_05 - type_3
obj_03 obj_07 obj_08 obj_10 - type_1
obj_01 obj_09 obj_04 - object)
(:init
(pred_3 obj_06 obj_07)
(pred_4 obj_06 obj_02)
(pred_4 obj_06 obj_05)
(pred_2 obj_01 obj_07)
(pred_2 obj_09 obj_03)
(pred_2 obj_04 obj_08)
)
(:goal
(and
(pred_2 obj_01 obj_08)
(pred_2 obj_09 obj_03)
(pred_2 obj_04 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_06 ?b obj_02))))
)
)

; plan
1. (op_2 obj_06 obj_01 obj_07 obj_05)
   deleted: (pred_2 obj_01 obj_07) (pred_4 obj_06 obj_05)
   added: (pred_1 obj_06 obj_01 obj_05)
   goals met: 1 of 3
2. (op_1 obj_06 obj_07 obj_08)
   deleted: (pred_3 obj_06 obj_07)
   added: (pred_3 obj_06 obj_08)
   goals met: 1 of 3
3. (op_3 obj_06 obj_01 obj_08 obj_05)
   deleted: (pred_1 obj_06 obj_01 obj_05)
   added: (pred_2 obj_01 obj_08) (pred_4 obj_06 obj_05)
   goals met: 2 of 3
4. (op_2 obj_06 obj_04 obj_08 obj_05)
   deleted: (pred_2 obj_04 obj_08) (pred_4 obj_06 obj_05)
   added: (pred_1 obj_06 obj_04 obj_05)
   goals met: 2 of 3
5. (op_1 obj_06 obj_08 obj_07)
   deleted: (pred_3 obj_06 obj_08)
   added: (pred_3 obj_06 obj_07)
   goals met: 2 of 3
6. (op_3 obj_06 obj_04 obj_07 obj_05)
   deleted: (pred_1 obj_06 obj_04 obj_05)
   added: (pred_2 obj_04 obj_07) (pred_4 obj_06 obj_05)
   goals met: 3 of 3
